import React from "react";
import "../App.css";

function page1() {
    const x = {
        weight: 350,
        height: 350,
      };
    
      return (
        <div>
          <div>
            <center>
              <h1>Pan Cake</h1>
              <img
                style={x}
                src="https://images.unsplash.com/photo-1589627461407-6257b1acf0fd?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlf%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=634&q=80"
              />
            
    
            <p><b>วัตถุดิบทำเพ้นเค้ก</b></p>
            <ul>
            <li>แป้งสาลีอเนกประสงค์ 100 กรัม</li>
            <li>น้ำตาล 2 ช้อนโต๊ะ</li>
            <li>ผงฟูทำขนมปัง 1 ช้อนชา</li>
            <li>ไข่ 1 ฟอง</li>
            <li>นมวัว 100 มิลลิลิตร</li>
            <li>เนย 30 กรัม</li>
            <li>เกลือ</li>
            </ul><br/>
    
    
    
            <p><b>วิธีทำ</b></p>
            <ul>
            <li>นำแป้งสาลี น้ำตาล เกลือ ผงฟูทำขนมปัง เทใส่ชาม แล้วกวนให้เข้ากัน</li>
            <li>ตอกไข่ กับ เทนมวัว ตามลงไป จากนั้นกวนให้ทุกอย่างเข้ากัน และมีความนุ่มขึ้น</li>
            <li>เมื่อกวนเสร็จ เติมเนยตามไป แล้วกวนให้เป็นเนื้อเดียวกันอีกที</li>
            <li>ตั้งกระทะแบนด้วยไฟกลางๆ</li>
            <li>เมื่อร้อนได้ที่ ให้ใส่เนย (เล็กน้อย) ลงไปในกระทะแบน จากนั้นรอให้เนยละลายจนหมด</li>
            <li>เริ่มเทส่วนผสมแพนเค้กลงบนกระทะ (ขนาดของแพนเค้ก แล้วแต่ความชอบของแต่ละบุคคล)</li>
            <li>พลิกแพนเค้กไปมา จนแพนเค้กมีสีน้ำตาลอ่อนๆ </li>
            <li>พร้อมเสิร์ฟได้เลย!</li>
            </ul>
            </center>
          </div>
        </div>
      );
    }

export default page1;
