import React from "react";
import "../App.css";

function page3() {
  const x = {
    weight: 350,
    height: 350,
  };

  return (
    <div>
      <div>
        <center>
          <h1>Spaghetti Tomato Sauce</h1>
          <img
            style={x}
            src="https://images.unsplash.com/photo-1605888969139-42cca4308aa2?ixid=MXwxMjA3fDB8MHxzZWFyY
                    2h8NDR8fHNwYWdoZXR0aSUyMGNhcmJvbmFyYXxlbnwwfHwwfA%3D%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60"
          />
        </center>

        <center>
          <p>
            <b>วัตถุดิบทำสปาเกตตี้ซอสมะเขือเทศ</b>
          </p>
        </center>
        <ul>
          <li>เส้นสปาเก็ตตี้ต้มสุกแล้ว 2 ถ้วยตวง</li>
          <li>เนื้อหมูสับ 1 ถ้วยตวง</li>
          <li>มะเขือเทศแกะเม็ดออกสับ 1 ลูกใหญ่ ประมาณ 100 กรัม</li>
          <li>
            หอมใหญ่หั่นสี่เหลี่ยมลูกเต๋าเล็ก 1/2 หัวเล็ก 1/4
            ถ้วยตวงเนยสดหรือมาการีน 70 กรัม
          </li>
          <li>ซอสมะเขือเทศ 1/2 ถ้วยตวง</li>
          <li>คนอร์อร่อยชัวร์ 2 ช้อนชา</li>
          <li>พริกไทยป่น 1/4 ช้อนชา</li>
          <li>ใบโหระพาสับ 5 ใบ</li>
          <li>เนยสด 3 ช้อนโต๊ะ</li>
        </ul>
        <br />

        <center>
          <p>
            <b>วิธีทำ</b>
          </p>
        </center>
        <ul>
          <li>
            ตั้งหม้อต้มน้ำให้เดือด แล้วใส่เส้นสปาเก็ตตี้ลงไป
            คนให้เส้นจมน้ำหมดทุกเส้น หรี่ไฟอ่อนพร้อมปิดฝา ต้มประมาณ 20 นาที
            เช็คว่าสุกหรือไม่ (ลองหักดูว่า ข้างในเป็นสีเสมอกันหรือไม่
            หากตรงกลางมีสีขาวๆ แสดงว่ายังไม่สุก)
            นำเส้นสปาเก็ตตี้ต้มสุกแช่น้ำเย็นสักครู่ สะเด็ดน้ำออก
            นำไปคลุกกับน้ำมันพืช พักไว้
          </li>
          <li>ตั้งกระทะให้ร้อนพร้อมใส่เนยสดและหัวหอมใหญ่ ผัดจนหอมสุก</li>
          <li>
            นำหมูสับลงไปผัดพอสุก ใส่มะเขือเทศสับ ซอสมะเขือเทศ
            และพริกไทยผัดให้เข้ากัน
          </li>
          <li>
            ปรุงรสด้วยคนอร์อร่อยชัวร์ และน้ำตาลทราย ผัดให้เข้ากัน
            ใส่ใบโหระพาสับผัดให้เข้ากันจนสุก นำเส้นสปาเก็ตตี้ใส่จาน
            ตักซอสมะเขือเทศหมูสับราดหน้า ตกแต่งด้วยใบโหระพาตามชอบพร้อมเสิร์ฟ
          </li>
        </ul>
      </div>
    </div>
  );
}

export default page3;
